tests/benchmark/v5-http-capacity.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="V5 HTTP Capacity Point" enabled="true">
      <stringProp name="TestPlan.comments">Measure only POST /program/order/create/v5 through HTTP response. One distinct user and one request per synchronized thread.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="protocol" elementType="Argument"><stringProp name="Argument.name">protocol</stringProp><stringProp name="Argument.value">${__P(protocol,http)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="host" elementType="Argument"><stringProp name="Argument.name">host</stringProp><stringProp name="Argument.value">${__P(host,127.0.0.1)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="port" elementType="Argument"><stringProp name="Argument.name">port</stringProp><stringProp name="Argument.value">${__P(port,6086)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="programId" elementType="Argument"><stringProp name="Argument.name">programId</stringProp><stringProp name="Argument.value">${__P(programId,900100)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="ticketCategoryId" elementType="Argument"><stringProp name="Argument.name">ticketCategoryId</stringProp><stringProp name="Argument.value">${__P(ticketCategoryId,900101)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Program Service HTTP Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments" enabled="true"><collectionProp name="Arguments.arguments"/></elementProp>
        <stringProp name="HTTPSampler.domain">${host}</stringProp>
        <stringProp name="HTTPSampler.port">${port}</stringProp>
        <stringProp name="HTTPSampler.protocol">${protocol}</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">3000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">90000</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Local No-token Headers" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json;charset=UTF-8</stringProp></elementProp>
          <elementProp name="no_verify" elementType="Header"><stringProp name="Header.name">no_verify</stringProp><stringProp name="Header.value">true</stringProp></elementProp>
          <elementProp name="userId" elementType="Header"><stringProp name="Header.name">userId</stringProp><stringProp name="Header.value">${userId}</stringProp></elementProp>
          <elementProp name="demoUserId" elementType="Header"><stringProp name="Header.name">X-Stellaris-Demo-User-Id</stringProp><stringProp name="Header.value">${userId}</stringProp></elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Distinct Isolated Users" enabled="true">
        <stringProp name="filename">${__P(dataFile,tests/benchmark/users.csv)}</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="variableNames">userId,ticketUserId,token</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <stringProp name="delimiter">,</stringProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">false</boolProp>
        <boolProp name="stopThread">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
      </CSVDataSet>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Synchronized V5 Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="One Request Per User" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(threads,50)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(threadRampSeconds,1)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Optional Keep-Alive Preconnect" enabled="true">
          <stringProp name="IfController.condition">${__P(preconnect,false)}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Preconnect Program Service" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments" enabled="true"><collectionProp name="Arguments.arguments"/></elementProp>
            <stringProp name="HTTPSampler.path">/actuator/health</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Preconnect Must Return HTTP 200" enabled="true">
              <collectionProp name="Asserion.test_strings"><stringProp name="49586">200</stringProp></collectionProp>
              <stringProp name="Assertion.custom_message">Preconnect failed</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">8</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Build Unique V5 Request" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[import groovy.json.JsonOutput
String requestId = UUID.randomUUID().toString()
vars.put('requestId', requestId)
vars.put('orderNumber', 'NOT_FOUND')
vars.put('failureType', 'TECHNICAL')
vars.put('businessCode', 'NOT_PARSED')
vars.put('businessMessage', '')
vars.put('requestBody', JsonOutput.toJson([
    requestId: requestId,
    programId: vars.get('programId'),
    userId: vars.get('userId'),
    ticketUserIdList: [vars.get('ticketUserId')],
    ticketCategoryId: vars.get('ticketCategoryId'),
    ticketCount: 1
]))]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST V5 Auto Seat HTTP" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Body" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">${requestBody}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/program/order/create/v5</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Release V5 Requests Together" enabled="true">
            <stringProp name="groupSize">${__P(threads,50)}</stringProp>
            <longProp name="timeoutInMs">120000</longProp>
          </SyncTimer>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Classify HTTP and Business Result" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script"><![CDATA[import groovy.json.JsonSlurper

String clean(Object value) {
    return value == null ? '' : String.valueOf(value).replaceAll(/[\r\n,]+/, ' ')
}

String httpCode = prev.getResponseCode()
if (httpCode != '200') {
    vars.put('failureType', 'TECHNICAL')
    vars.put('businessCode', httpCode != null && httpCode.startsWith('Non HTTP') ? 'TRANSPORT_ERROR' : 'HTTP_' + clean(httpCode))
    vars.put('businessMessage', clean(prev.getResponseMessage()))
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('Technical HTTP failure: ' + clean(prev.getResponseMessage()))
    return
}

try {
    def json = new JsonSlurper().parseText(prev.getResponseDataAsString())
    String code = json.code == null ? 'NULL' : String.valueOf(json.code)
    String message = clean(json.message)
    vars.put('businessCode', code)
    vars.put('businessMessage', message)
    if (code != '0') {
        vars.put('failureType', 'BUSINESS')
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage('Business failure: code=' + code + ' message=' + message)
        return
    }
    if (json.data == null || !(String.valueOf(json.data) ==~ /\d+/)) {
        vars.put('failureType', 'TECHNICAL')
        vars.put('businessCode', 'INVALID_SUCCESS_BODY')
        vars.put('businessMessage', 'code=0 but numeric orderNumber is missing')
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage('Invalid success response contract')
        return
    }
    vars.put('failureType', 'SUCCESS')
    vars.put('orderNumber', String.valueOf(json.data))
} catch (Exception e) {
    vars.put('failureType', 'TECHNICAL')
    vars.put('businessCode', 'INVALID_JSON')
    vars.put('businessMessage', clean(e.getMessage()))
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('Invalid JSON: ' + clean(e.getMessage()))
}]]></stringProp>
          </JSR223Assertion>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>